In [ ]:
"""
Customers Who Never Order

Suppose that a website contains two tables, the Customers table and the Orders table. Write a SQL query to find all customers who never order anything.

Table: Customers.

+----+-------+
| Id | Name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
Table: Orders.

+----+------------+
| Id | CustomerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
"""

In [ ]:
"""testcase"""
{"headers": {"Customers": ["Id", "Name"], "Orders": ["Id", "CustomerId"]}, 
 "rows": {"Customers": [[1, "Joe"], [2, "Henry"], [3, "Sam"], [4, "Max"]], "Orders": [[1, 3], [2, 1]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS Customers;
DROP TABLE IF EXISTS Orders;

CREATE TABLE Customers(
Id  int(4) NOT NULL,
Num varchar(32) NOT NULL,
PRIMARY KEY ('Id'));

INSERT INTO Customers VALUES
(1, "Joe"),
(2, "Henry"),
(3, "Sam"),
(4, "Max");

CREATE TABLE Orders(
Id int(4) NOT NULL,
CustomerId int(4) NOT NULL,
PRIMARY KEY ('Id'));

INSERT INTO Orders VALUES
(1, 3),
(2, 1);

In [ ]:
"""SQL solution"""
# 1
SELECT c.Name AS Customers
FROM Customers AS c
WHERE c.Id NOT IN (SELECT CustomerId FROM Orders)

# 2
SELECT c.Name AS Customers
FROM Customers AS c
LEFT JOIN Orders AS o
ON c.Id = o.CustomerId
WHERE o.CustomerId IS NULL

# 3
SELECT c.Name AS Customers
FROM Customers AS c
WHERE NOT EXISTS (SELECT * FROM Orders As o WHERE c.Id = o.CustomerId)

In [2]:
"""pandas dataframe creation"""
import pandas as pd

tc = [(1, "Joe"),
(2, "Henry"),
(3, "Sam"),
(4, "Max")]

Customers = pd.DataFrame(tc, columns=['Id', 'Name'])

to = [(1, 3),
(2, 1)]

Orders = pd.DataFrame(to, columns=['Id', 'CustomerId'])

Customers.head()

   Id   Name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [4]:
Orders.head()

   Id  CustomerId
0   1           3
1   2           1

In [11]:
# 1
Customers[~Customers['Id'].isin(Orders['CustomerId'])]['Name']

1    Henry
3      Max
Name: Name, dtype: object

In [14]:
# 2
df = pd.merge(Customers, Orders, left_on='Id', right_on='CustomerId', how='left', suffixes=['_customer', '_order'])
df[df['CustomerId'].isna()]['Name']

1    Henry
3      Max
Name: Name, dtype: object